// Какое будет выведено значение: let x = 5; alert( x++ ); ?
// let x = 5;
// alert(x++);
// Ответ: 5

// Чему равно такое выражение: [ ] + false - null + true ?
// Ответ: NaN

// Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?
// let y = 1;
// let x = (y = 2);
// alert(x);
// Ответ: 2

// Чему равна сумма [ ] + 1 + 2?
// console.log([] + 1 + 2);
// Ответ: '12'

// Что выведет этот код: alert( "1"[0] )?
// alert('1'[0]);
// Ответ: 1

// Чему равно 2 && 1 && null && 0 && undefined ?
// console.log(2 && 1 && null && 0 && undefined);
// Ответ: null
// (И запирается на лжи )
// (ИЛИ запирается на правде)

// Есть ли разница между выражениями? !!( a && b ) и (a && b)?
// console.log(!!(a && b) === (a && b));
// console.log(!!(1 && 2) === (1 && 2));
// Ответ: !!(a && b) === boolean, значит boolean не равно (1 && 2)

// Что выведет этот код: alert( null || 2 && 3 || 4 ); ?
// alert(null || (2 && 3) || 4);
// Ответ: 3

// a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ?
// const a = [1, 2, 3];
// const b = [1, 2, 3];
// console.log(a == b);
// Ответ: нет

// Что выведет этот код: alert( +"Infinity" ); ?
// alert(+'Infinity');
// Ответ: typeOf Number(Infinity)

// Верно ли сравнение: "Ёжик" > "яблоко"?
// console.log('Ёжик' > 'яблоко');
// Ответ: false

// Чему равно 0 || "" || 2 || undefined || true || falsе ?
// Ответ: 2
